# Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те 
# числа, которые встречаются в обоих наборах. Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во 
# элементов второго множества. Затем пользователь вводит сами элементы множеств.
# Пример:
# 11 6
# 2 4 6 8 10 12 10 8 6 4 2
# 3 6 9 12 15 18
# 6 12

n = (int(input("Введите число N элементов: ")))
my_list_1 = set()
for i in range(n):
    num = int(input("Введите число "))
    my_list_1.add(num)
print(my_list_1)


m = (int(input("Введите число M элементов: ")))
my_list_2 = set()
for i in range(m):
    num = int(input("Введите число "))
    my_list_2.add(num)
print(my_list_2)


search = my_list_1.intersection(my_list_2)
res = sorted(search)
print(res)